espressif/esp-idf/components/soc/esp32s3/include/soc/syscon_reg.h
#define SYSCON_RETENTION_CTRL1_REG          (DR_REG_SYSCON_BASE + 0xB8)
/* SYSCON_RETENTION_TAG_LINK_ADDR : R/W ;bitpos:[26:0] ;default: 27'd0 ; */
/*description: .*/
#define SYSCON_RETENTION_TAG_LINK_ADDR    0x07FFFFFF
#define SYSCON_RETENTION_TAG_LINK_ADDR_M  ((SYSCON_RETENTION_TAG_LINK_ADDR_V)<<(SYSCON_RETENTION_TAG_LINK_ADDR_S))
#define SYSCON_RETENTION_TAG_LINK_ADDR_V  0x7FFFFFF
#define SYSCON_RETENTION_TAG_LINK_ADDR_S  0

#define SYSCON_RETENTION_CTRL2_REG          (DR_REG_SYSCON_BASE + 0xBC)
/* SYSCON_RET_ICACHE_ENABLE : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: .*/
#define SYSCON_RET_ICACHE_ENABLE    (BIT(31))
#define SYSCON_RET_ICACHE_ENABLE_M  (BIT(31))
#define SYSCON_RET_ICACHE_ENABLE_V  0x1
#define SYSCON_RET_ICACHE_ENABLE_S  31
/* SYSCON_RET_ICACHE_START_POINT : R/W ;bitpos:[29:22] ;default: 8'd0 ; */
/*description: .*/
#define SYSCON_RET_ICACHE_START_POINT    0x000000FF
#define SYSCON_RET_ICACHE_START_POINT_M  ((SYSCON_RET_ICACHE_START_POINT_V)<<(SYSCON_RET_ICACHE_START_POINT_S))
#define SYSCON_RET_ICACHE_START_POINT_V  0xFF
#define SYSCON_RET_ICACHE_START_POINT_S  22
/* SYSCON_RET_ICACHE_VLD_SIZE : R/W ;bitpos:[20:13] ;default: 8'hff ; */
/*description: .*/
#define SYSCON_RET_ICACHE_VLD_SIZE    0x000000FF
#define SYSCON_RET_ICACHE_VLD_SIZE_M  ((SYSCON_RET_ICACHE_VLD_SIZE_V)<<(SYSCON_RET_ICACHE_VLD_SIZE_S))
#define SYSCON_RET_ICACHE_VLD_SIZE_V  0xFF
#define SYSCON_RET_ICACHE_VLD_SIZE_S  13
/* SYSCON_RET_ICACHE_SIZE : R/W ;bitpos:[11:4] ;default: 8'hff ; */
/*description: .*/
#define SYSCON_RET_ICACHE_SIZE    0x000000FF
#define SYSCON_RET_ICACHE_SIZE_M  ((SYSCON_RET_ICACHE_SIZE_V)<<(SYSCON_RET_ICACHE_SIZE_S))
#define SYSCON_RET_ICACHE_SIZE_V  0xFF
#define SYSCON_RET_ICACHE_SIZE_S  4

#define SYSCON_RETENTION_CTRL3_REG          (DR_REG_SYSCON_BASE + 0xC0)
/* SYSCON_RET_DCACHE_ENABLE : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: .*/
#define SYSCON_RET_DCACHE_ENABLE    (BIT(31))
#define SYSCON_RET_DCACHE_ENABLE_M  (BIT(31))
#define SYSCON_RET_DCACHE_ENABLE_V  0x1
#define SYSCON_RET_DCACHE_ENABLE_S  31
/* SYSCON_RET_DCACHE_START_POINT : R/W ;bitpos:[30:22] ;default: 9'd0 ; */
/*description: .*/
#define SYSCON_RET_DCACHE_START_POINT    0x000001FF
#define SYSCON_RET_DCACHE_START_POINT_M  ((SYSCON_RET_DCACHE_START_POINT_V)<<(SYSCON_RET_DCACHE_START_POINT_S))
#define SYSCON_RET_DCACHE_START_POINT_V  0x1FF
#define SYSCON_RET_DCACHE_START_POINT_S  22
/* SYSCON_RET_DCACHE_VLD_SIZE : R/W ;bitpos:[21:13] ;default: 9'h1ff ; */
/*description: .*/
#define SYSCON_RET_DCACHE_VLD_SIZE    0x000001FF
#define SYSCON_RET_DCACHE_VLD_SIZE_M  ((SYSCON_RET_DCACHE_VLD_SIZE_V)<<(SYSCON_RET_DCACHE_VLD_SIZE_S))
#define SYSCON_RET_DCACHE_VLD_SIZE_V  0x1FF
#define SYSCON_RET_DCACHE_VLD_SIZE_S  13
/* SYSCON_RET_DCACHE_SIZE : R/W ;bitpos:[12:4] ;default: 9'h1ff ; */
/*description: .*/
#define SYSCON_RET_DCACHE_SIZE    0x000001FF
#define SYSCON_RET_DCACHE_SIZE_M  ((SYSCON_RET_DCACHE_SIZE_V)<<(SYSCON_RET_DCACHE_SIZE_S))
#define SYSCON_RET_DCACHE_SIZE_V  0x1FF
#define SYSCON_RET_DCACHE_SIZE_S  4

#define SYSCON_RETENTION_CTRL4_REG          (DR_REG_SYSCON_BASE + 0xC4)
/* SYSCON_RETENTION_INV_CFG : R/W ;bitpos:[31:0] ;default: ~32'h0 ; */
/*description: .*/
#define SYSCON_RETENTION_INV_CFG    0xFFFFFFFF
#define SYSCON_RETENTION_INV_CFG_M  ((SYSCON_RETENTION_INV_CFG_V)<<(SYSCON_RETENTION_INV_CFG_S))
#define SYSCON_RETENTION_INV_CFG_V  0xFFFFFFFF
#define SYSCON_RETENTION_INV_CFG_S  0

#define SYSCON_RETENTION_CTRL5_REG          (DR_REG_SYSCON_BASE + 0xC8)
/* SYSCON_RETENTION_DISABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SYSCON_RETENTION_DISABLE    (BIT(0))
#define SYSCON_RETENTION_DISABLE_M  (BIT(0))
#define SYSCON_RETENTION_DISABLE_V  0x1
#define SYSCON_RETENTION_DISABLE_S  0

#define SYSCON_DATE_REG          (DR_REG_SYSCON_BASE + 0x3FC)
/* SYSCON_DATE : R/W ;bitpos:[31:0] ;default: 32'h2101150 ; */
/*description: Version control.*/
#define SYSCON_DATE    0xFFFFFFFF
#define SYSCON_DATE_M  ((SYSCON_DATE_V)<<(SYSCON_DATE_S))
#define SYSCON_DATE_V  0xFFFFFFFF
#define SYSCON_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SYSCON_REG_H_ */
